 ///////////////////////////////////////////////                    In the name of God                      \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
===============================>>>>                           producer: seyed hesammodin hossieni                             <<<<==============================
//////////////////////
///                                                            Computer Basics                        \\\\\\\\\\\\\\\\\\\\\\\\\\



/*مساحت و محیط دایره را به صورت زیر محاسبه کنید؟




/*الگوریتمی که درجه حرارت سانتیگراد میخواند وبه فارنهایت تبدیل می کند؟





/*الگوریتمی که طول وعرض مستطیل را از ورودی خوانده،محیطو مساحت ان را محاسبه می کندو به خروجی می برد؟





/*الگوریتمی که قاعده و ارتفاع مثلثی را خوانده،مساحت ان را محاسبه کند و به خروجی می برد





/* قرار می دهد و سپس محتویات ان دو را با هم عوض کرده،در خروجی چاپ می کند؟x,y الگوریتمی که دو مقدار از ورودی خوانده، در دو متغیر





/*الگوریتمی که در سوال قبلی بود را بدون استفده از متغیر کمکی حل کنید؟





/*الگوریتمی که دو مقدار را از ورودی خوانده، مقدار بزرگتر را در خروجی چاپ کند؟





/* را به صورت زیر محاسبه کند؟ y رااز ورودی می خواند و مقدارx الگوریتمی که عددی مثل





/*(2x+5) را از ورودی خوانده،اگر عدد زوج باشد،عبارت x الگوریتمی که عددی مثل
رامحاسبه می کند و به خروجی می برد؟. (x2-5)ولی اگر عدد فرد باش





/*الگوریتمی که 3 مقدار را از ورودی خوانده اهنها را به ترتیب نزولی در خروجی چاپ می کند منظور از ترتیب نزولی این است که اعداد از بزرگ به کوچک در خروجی چاپ شوند





/*الگوریتمی که عددی را خوانده ،قدر مطلق آن را در خروجی چاپ می کند؟





/* را پیدا کرده،در خروجی چاپ کند؟ (ax2+bx+c=0)الگوریتمی که جواب معاذله درجه دوم







/*مثال17 صفحه 76





/* را از ورودی خوانده ، وانها را محاسبه می کند و به خروجی می برد؟N الگوریتمی که تعداد





/*را از ورودی خوانده ، تعداد اعداد منفی،صفر،مثبت را مشخص کرده، چاپ می کند؟N الگوریتمی که تعداد





/*الگوریتمی که تعدادی عدد را خوانده،بزرگتین عدد را چاپ می کند؟






/* رااز ورودی خوانده،فاکتوریل ان را محاسبه می کند؟ Nالگوریتمی که عدد صحیح و مثبت





/*مثال22 صفحه22




/*الگوریتمی که یک عدد مبنای 10را خوانده ،آن را به مبنای 2 می برد و نتیجه را چاپ می کند؟





/*الگوریتمی که20جمله اول دنباله فیبوناچی را تولید و چاپ می کند؟




/* پایه لگاریتم نپرین)را با استفده از رابطه زیر محاسبه کنید؟) eالگوریتمی که مقدار





/* (s=1+2+3...+n)  جمله از دنباله زیر را محاسبه کرده،به خروجی می برد؟ nالگوریتمی که مجموع




/*(s=1-2+3-4+...+n)  جمله از دنباله زیر را محاسبه کرده،به خروجی می برد؟ nالگوریتمی که مجموع




/* عددصحیح و مثبت را از وزودی خوانده،تعداداعدادی راکه بر3 قابل قسمت هستند مشخص کند؟ Nالگوریتمی که تعداد





/*الگوریتمی که تعدادی را خوانده،اعدادی را که رقم سمت راست انها 5است مشخص می کند و به خروجی می برد.اخرین عدد ورودی صفر است؟





/* راچاپ نمایید؟ HتاL را خوانده همه اعداد زوج H,Lالگوریتمی دو عدد





/*الگوریتمی که نمرات دانش آموزی را از ورودی خوانده ،معدل وی را محاسبه کند؟





/*مثال33صفحه 92





/*الگوریتمی که دو عدد صحیح مثبت را از ورودی خوانده،حاصل ضرب آنها را با استفاده از عمل جمع محاسبه کنید؟





/*الگوریتمی که دو عدد صحیح و مثبت را از ورودی خوانده،آنها را با عمل تفریق بر هم تقسیم کند؟





/*مثال36 صفحه96





/*الگوریتمی که تعدادی عدد صحیح را خوانده،وارون انها را محاسبه کنید؟







/*مثال 38 صفحه 101






/*الگوریتمی که تعدادی شماره دانشجویی و معدل را خوانده،سپس شماره دانشجویی دو دانشجویی که بالاترین معدل را دارند چاپ میکند؟





/*الگوریتمی که عدد صحیح مثبت را از ورودی خوانده،مشخص می کند که چند رقمی است؟





/* اول است یا خیر N رااز ورودی خوانده،مشخص می کند که Nالگوریتمی که عددی مثل






/*.الگوریتمی که عددرا از ورودی خوانده،مشخص می کند که ایا ان عدد،یک عدد کامل است یا خیر






/*را از ورودی خوانده،بزرگترین مقسوم علیه مشترک(ب.م.م) وکوچکترین(ک.م.م) مضرب مشترک ان دو عدد را محاسبه کنید؟ Nالگوریتمی که دو عدد صحیح و مثبت




/*الگوریتمی که شماره دانشجویی،تعداد درس،نمرات و واحد درس یک ترم تعدادی دانشجو را از ورودی خوانده،
معدل انها را محاسبه کند،به خروجی می برد.مشخص می کند که چند نفر از دانشجویان معدلشان بیش از 17است(دانشجویان ممتاز)





/* الگوریتمی که عددی را که بیانگر مقداری پول است از ورودی خوانده،آنها را به سکه ها50،20،10،5،2،1 ریالی طوری خرد کند که تعداد سکه ها حداقل باشد؟






/*الگوریتمی که یک سکه 100 ریالی را به سکه های 2،5،10،20،50 ریالی خورد کند که تمام حالت های ممکن را شامل شود؟





//////////////////////////////    The third chapter exercises   ////////////////////////////////
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
//@                               ALL PROGRAMS WRITTEN BY seyed hesammodin hossieni                           @
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
/* را محاسبه کنید؟ Rالگوریتمی بنویسید که محیط و مساحت دایره به شعاع





/* N=1+2+3+...+N  الگوریتمی که عبارت زیر را محاسبه کند؟





/*الگوریتمی بنویسید که یک عدد مبنای2را به مبنای10 ببرد؟






/*معلوم است)؟ ABC الگوریتمی بنویسید که محیط و مساحت یک مثلث را با داشتن مختصات رِئوس ان مشخص کند(مختصات رئوس مثلث





/*الگوریتمی بنویسید که تعدادی عدد را خوانده و سپس تعداد اعداد مثبت،منفی،صفر را چاپ کند؟




/*الگوریتمی که نام و تعدادی دانشجو را خوانده و نام شخصی که بیشترین معدل را دارد در خروجی چاپ کند؟



 /* الگوریتمی بنویسید که مجموع 10 جمله اول دنباله زیر را محاسبه و چاپ کرده؟



/*تمرین 10 صفحه 118




/*الگوریتمی بنویسید که تعدادی عدد را  خوانده و مشخص کند که ایا این اعداد مرتب هستند یا خیر؟اگر مرتب هستند مرتب صعودی یا مرتب نزولی؟




/*عدد فرد متوالی که از یک شروع می شود بدست آورد به عنوان مثال   1+3+5+7+9+11:=2^6   الگوریتمی بنویسید که یک عدد صحیح مثبت را خواننده وو طبق این روند،مربع ان را حساب کند و به همراه خود عدد به خروجی ببردN را می توان به صورت مجموعN مربع هر عدد صحیح مثبت




/*الگوریتمی بنویسید که تعداد عددی را خواننده و هر عدد که بر 9 بخش پذیر باشد را در خروجی چاپ کند(از روش مجموع ارقام استفاده کنید)؟




/*الگوریتمی بنویسید که عددی را خواننده و مشخص می کند که ایا عدد متقارن است یا خیر عددی متقارن است که دو رقم سمت راست آن، عکس دو رقم سمت چپ ان باشد.چه عددمتقارن باشد.پیام مناسبی صادر کند. نمونه ای از اعداد متقارن عبارتند از:32423و12421





/*تمرین 15صفحه ی118





/*  s=1+1/2!+1/3!+1/4!+...    الگوریتمی بنویسید که عبارت زیر را تا 10 جمله حساب کند




/*الگوریتمی بنویسید که تعدادی عدد را از ورودی خواننده و اعدادی که رقم یکسان 7 دارند را در خروجی چاپ کند؟





/*تمرین 18 صفحه ی119




*/
/*تمرین19 صفحه ی119




/*تمرین20صفحه ی 119




/*  2/1*2/3*4/3*4/5*6/5*6/8*8/7*...             مقایسه کند.اگر تفاوت برابر صفر باشد،الگوریتم خاتمه یابد؟  pi==(3/14159)الگوریتمی بنویسید که حاصل ضرب  دنباله زیر را بدست آورده و در هر عمل،تفاوت ان را با





/*را خوانده ومشخص کند که روز تولد این فرد چه روزی از هفته است فرض کنید همه سالها365روز باشد؟ K,M,N روز است الگوریتمی بنویسید که k ماه وMسال و N در تاریخ 74/8/15 که دوشنبه است سن شخص




/*الگوریتمی بنویسید که تعدادی عدد را خوانده و اعدادی که مجموع ارقام انها بیشتر از 45 باشد را چاپ کرده و تعداد این اعداد را مشخص کند؟





/*تمرین 24 صفحه ی119




/* ?راچاپ کند k الگوریتمی بنویسید که 10 مضرب اولیه





/*را خوانده و ان را به عوامل اول تجزیه کند و هر یک از عوامل را با توان آن چاپ کند؟ N الگوریتمی بنویسید که عدد صحیح





/*الگوریتمی بنویسیدکه تمام اعداد کامل کوچکتر از 1000را پیدا کرده و در خروجی چاپ کند.عدد کامل عددی است که مجموع تمام مقسوم علیه هایش(بجز خودش)با خود عدد برابر باشد مثل:28=1+2+6+7+14




/*e^-x = 1-x + x^2/2! + x^3/3! + x^4/4!  را با استفاده از سطر زیر با تقریب 0/001 محاسبه کنید؟ e^-xالگوریتمی بنویسید که





/*ریالی را دریافت کند وبا توجه به سکه های رایج کشور آن را با حداقل تعداد سکه خرد کند.تعداد سکه ها و نوع آنها را مشخص کنید؟ n سکه های رایج کشور عبارتند از 1و2و5و10و20و50و100و250ریالی الگوریتمی بنویسید که یک اسکناس





/*تمرین 30 صفحه ی 120


